# Zsh
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# unix utils
brew 'binutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnutls'
brew 'htop-osx'
brew 'docker'
brew 'nmap'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'md5sha1sum'
brew 'gawk'

# ruby
brew 'rbenv'
brew 'ruby-build'

# build
brew 'autoconf'
brew 'automake'
brew 'coreutils'
#brew 'diffutils'
brew 'cmake'


brew 'ansible'
brew 'maven'

# bin
#brew 'node'


# casks
brew 'caskroom/cask/brew-cask'
brew 'brew-cask'

# apps
cask 'diffmerge'
cask 'google-chrome'
cask '1password'
#cask 'istat-menus'
cask 'iterm2'
#cask 'little-snitch'
#cask 'mindnode-pro'
# install from appstore
# cask 'moom'
#cask 'omnigraffle'
cask 'renamer'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
#cask 'spotify'
#cask 'sublime-text3'
cask 'textwrangler'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
cask 'dockertoolbox'
cask 'java'
cask 'Caskroom/cask/postman'
# tunnelblick
# vmware-fusion pro
cask 'caskroom/cask/thunderbird'
cask 'Caskroom/cask/remote-desktop-manager'
cask 'alfred'
#cask 'csshx' manual installed...
cask 'mysql56'

# install quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

# install fonts
tap 'caskroom/fonts'
cask 'font-inconsolata-dz-for-powerline'
