# Zsh
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# unix utils
brew 'binutils'
#brew 'findutils --with-default-names'
brew 'findutils'
#brew 'gnu-sed --with-default-names'
brew 'gnu-sed'
brew 'gnutls'
brew 'htop-osx'
brew 'docker'
brew 'nmap'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'md5sha1sum'
brew 'gawk'
#brew 'gnu-which --with-default-names'
#brew 'grep --with-default-names'
brew 'grep'

# ruby
brew 'rbenv'
brew 'ruby-build'

# build
brew 'autoconf'
brew 'automake'
brew 'coreutils'
#brew 'diffutils'
brew 'cmake'


#brew 'ansible'
brew 'maven'
#brew 'sbt'
brew 'node'
#brew 'openjdk'
brew 'sdkman'
brew 'switchaudio-osx' # change audio settings from terminals
brew 'jq'
brew 'colordiff'
brew 'google-backup-and-sync'

# casks
#brew 'caskroom/cask/brew-cask'
#brew 'brew-cask'

cask 'intellij-idea'
#cask 'libreoffice'
#cask 'libreoffice-language-pack'
cask 'macdown'
cask 'postman'
cask 'diffmerge'
cask 'google-chrome'
#cask '1password'
#cask 'istat-menus'
cask 'iterm2'
#cask 'little-snitch'
#cask 'mindnode-pro'
# install from appstore
# cask 'moom'
#cask 'omnigraffle'
cask 'renamer'
#cask 'sequel-pro'
#cask 'skype'
cask 'spectacle'
#cask 'slack'
cask 'spotify'
cask 'sublime-text'
#cask 'textwrangler'
cask 'thunderbird'
#cask 'virtualbox'
#cask 'vagrant'
#cask 'vlc'
cask 'docker-toolbox'
#cask 'macpass'
# keepassxc

#cask 'rambox'
#brew 'franz'

#cask 'stoplight-studio' # api design first
#cask 'teamviewer'
#cask 'zoom'
#cask 'zoomus'

cask 'firefox'
#cask 'cyberduck' # ftp,s3 etc. browser
#cask 'bloomrpc' # grpc gui client
#cask 'java'

#cask 'tunnelblick'

# vmware-fusion pro
#cask 'Caskroom/cask/remote-desktop-manager'
cask 'alfred'
#cask 'csshx' manual installed...
#cask 'mysql56'

# install quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
#cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

# install fonts
#tap 'caskroom/fonts'
#cask 'font-inconsolata-dz-for-powerline'
